/*******************************************************************************
  * @file                   pid.c
  * @Author:                MQjehovah                 mail:MQjehovah@hotmail.com
  * @version                1.0.0
  * @date                   2016.5.24
  * @brief					PID控制
  ******************************************************************************
  * @attention
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "pid.h"
/* Definition ----------------------------------------------------------------*/

/* Functions -----------------------------------------------------------------*/
/*******************************************************************************
  * @brief  位置式(全量式)PID控制
  * @param  None
  * @retval None
  * @Note   pid输出计算
*******************************************************************************/
int LocPIDCalc(PID_Type *PID, int cur_err)
{
    //double timeChange = 1;//1ms		//pid计算时间间隔 这里为1ms，视为时间单位省略
    PID->eP = cur_err;					//反馈值与输入值的差值 e(t) = 比例
    PID->eI += PID->eP;					//差值*时间间隔乘积累加 = 积分  理论是零
    PID->eD = PID->eP - PID->lastErr;	//差值-上一次差值 = 微分
    PID->OUT = PID->kP * PID->eP		//比例项
               + PID->kI * PID->eI		//积分项
               + PID->kD * PID->eD;		//微分项
    PID->lastErr = PID->eP;				//下次循环: 当前比例成为过去比例
    return PID->OUT;
}
/*******************************************************************************
  * @brief  增量式式PID控制
  * @param  None
  * @retval ΔU(k)
  * @Note   输出：U(k)=U(k-1)+ΔU(k)
*******************************************************************************/
int IncPIDCalc(PID_Type *PID, int cur_err)
{
    //当前误差
    PID->eP = cur_err;
    //增量计算
    PID->OUT = PID->kP * PID->eP //E[k]项
               - PID->kI * PID->lastErr //E[k－1]项
               + PID->kD * PID->preErr; //E[k－2]项
    //存储误差，用于下次计算
    PID->preErr = PID->lastErr;
    PID->lastErr = PID->eP;
    //返回增量值
    return(PID->OUT);
}

/*********************************END OF FILE**********************************/
